levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_interrupts.c
/**
 *******************************************************************************
 * @file  hc32m423_interrupts.c
 * @brief This file provides firmware functions to manage the Interrupt Controller
 *        (INTC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-02-01       Zhangxl         First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32m423_interrupts.h"
#include "hc32m423_utility.h"

/**
 * @addtogroup HC32M423_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_INTERRUPTS INTERRUPTS
 * @brief INTC Driver Library
 * @{
 */

#if (DDL_INTERRUPTS_ENABLE == DDL_ON) || (DDL_EXINT_NMI_SWI_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup INTC_Local_Macros INTC Local Macros
 * @{
 */
/**
 * @brief   Maximum IRQ handler number
 */
#define IRQ_NUM_MAX         8U

/**
 * @defgroup INTC_Check_Parameters_Validity INTC Check Parameters Validity
 * @{
 */
/*  Parameter validity check for wakeup source from stop mode. */
#define IS_INTC_WKUP_SRC(src)                                                   \
(   ((src) & (INTC_WUPEN_EIRQWUEN   | INTC_WUPEN_SWDTWUEN   |                   \
             INTC_WUPEN_PVD1WUEN    | INTC_WUPEN_PVD2WUEN   |                   \
             INTC_WUPEN_CMPI0WUEN   | INTC_WUPEN_TMR0WUEN   |                   \
             INTC_WUPEN_RXWUEN)) != (uint32_t)0x00000000UL)

/*  Parameter validity check for event number. */
#define IS_INTC_EVENT(event)                                                    \
(   ((event) & (INTC_EVTER_EVTE0    | INTC_EVTER_EVTE1      |                   \
                INTC_EVTER_EVTE2    | INTC_EVTER_EVTE3      |                   \
                INTC_EVTER_EVTE4    | INTC_EVTER_EVTE5      |                   \
                INTC_EVTER_EVTE6    | INTC_EVTER_EVTE7      |                   \
                INTC_EVTER_EVTE8    | INTC_EVTER_EVTE9      |                   \
                INTC_EVTER_EVTE10   | INTC_EVTER_EVTE11     |                   \
                INTC_EVTER_EVTE12   | INTC_EVTER_EVTE13     |                   \
                INTC_EVTER_EVTE14   | INTC_EVTER_EVTE15)) != (uint32_t)0x00000000UL)

/*  Parameter validity check for interrupt index. */
#define IS_INTC_INT(int)                                                        \
(   ((int) &    (INTC_IER_IER0      | INTC_IER_IER1         |                   \
                INTC_IER_IER2       | INTC_IER_IER3         |                   \
                INTC_IER_IER4       | INTC_IER_IER5         |                   \
                INTC_IER_IER6       | INTC_IER_IER7         |                   \
                INTC_IER_IER8       | INTC_IER_IER9         |                   \
                INTC_IER_IER10      | INTC_IER_IER11        |                   \
                INTC_IER_IER12      | INTC_IER_IER13        |                   \
                INTC_IER_IER14      | INTC_IER_IER15)) != (uint32_t)0x00000000UL)

/*  Parameter validity check for software interrupt index. */
#define IS_INTC_SWI(swi)                                                        \
(   ((swi) &   (INTC_SWIER_SWIE0    | INTC_SWIER_SWIE1      |                   \
                INTC_SWIER_SWIE2    | INTC_SWIER_SWIE3      |                   \
                INTC_SWIER_SWIE4    | INTC_SWIER_SWIE5      |                   \
                INTC_SWIER_SWIE6    | INTC_SWIER_SWIE7      |                   \
                INTC_SWIER_SWIE8    | INTC_SWIER_SWIE9      |                   \
                INTC_SWIER_SWIE10   | INTC_SWIER_SWIE11     |                   \
                INTC_SWIER_SWIE12   | INTC_SWIER_SWIE13     |                   \
                INTC_SWIER_SWIE14   | INTC_SWIER_SWIE15)) != (uint32_t)0x00000000UL)

/*  Parameter validity check for NMI pin filter A function. */
#define IS_NMI_FAE(fae)                                                         \
(   ((fae) == NMI_FILTER_A_OFF)                 ||                              \
    ((fae) == NMI_FILTER_A_ON))

/*  Parameter validity check for NMI pin filter B function. */
#define IS_NMI_FBE(fbe)                                                         \
(   ((fbe) == NMI_FILTER_B_OFF)                 ||                              \
    ((fbe) == NMI_FILTER_B_ON))

