levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_interrupts.c
/*  Parameter validity check for MNI pin filter A clock division. */
#define IS_NMI_FACLK(faclk)                                                     \
(   ((faclk) == NMI_FACLK_HCLK_DIV1)            ||                              \
    ((faclk) == NMI_FACLK_HCLK_DIV8)            ||                              \
    ((faclk) == NMI_FACLK_HCLK_DIV32)           ||                              \
    ((faclk) == NMI_FACLK_HCLK_DIV64))

/*  Parameter validity check for NMI pin trigger edge. */
#define IS_NMI_TRIGGER(trigger)                                                 \
(   ((trigger) == NMI_TRIGGER_FALLING)          ||                              \
    ((trigger) == NMI_TRIGGER_RISING))

/*  Parameter validity check for NMI trigger souce. */
#define IS_NMI_SRC(src) (((src) & NMI_SRC_MASK) != (uint32_t)0x00000000UL)

/*  Parameter validity check for get NMI trigger source. */
#define IS_GET_NMI_SRC(src)                                                     \
(   ((src) == NMI_SRC_NMI_PIN)                  ||                              \
    ((src) == NMI_SRC_SWDT)                     ||                              \
    ((src) == NMI_SRC_LVD1)                     ||                              \
    ((src) == NMI_SRC_LVD2)                     ||                              \
    ((src) == NMI_SRC_XTAL_STP)                 ||                              \
    ((src) == NMI_SRC_RAMPE)                    ||                              \
    ((src) == NMI_SRC_WDT))

/*  Parameter validity check for EXINT filter A function. */
#define IS_EXINT_FAE(fae)                                                       \
(   ((fae) == EXINT_FILTER_A_OFF)               ||                              \
    ((fae) == EXINT_FILTER_A_ON))

/*  Parameter validity check for EXINT filter B function. */
#define IS_EXINT_FBE(fbe)                                                       \
(   ((fbe) == EXINT_FILTER_B_OFF)               ||                              \
    ((fbe) == EXINT_FILTER_B_ON))

/*  Parameter validity check for EXINT filter clock division. */
#define IS_EXINT_FACLK(faclk)                                                   \
(   ((faclk) == EXINT_FACLK_HCLK_DIV1)           ||                             \
    ((faclk) == EXINT_FACLK_HCLK_DIV8)           ||                             \
    ((faclk) == EXINT_FACLK_HCLK_DIV32)          ||                             \
    ((faclk) == EXINT_FACLK_HCLK_DIV64))

/*  Parameter validity check for EXINT filter clock division. */
#define IS_NMI_EXINT_FBTIM(fbtim)                                               \
(   ((fbtim) == NMI_EXINT_FBTIM_500NS)           ||                             \
    ((fbtim) == NMI_EXINT_FBTIM_1US)             ||                             \
    ((fbtim) == NMI_EXINT_FBTIM_2US)             ||                             \
    ((fbtim) == NMI_EXINT_FBTIM_4US))

/*  Parameter validity check for EXINT trigger edge. */
#define IS_EXINT_TRIGGER(trigger)                                               \
(   ((trigger) == EXINT_TRIGGER_LOW)            ||                              \
    ((trigger) == EXINT_TRIGGER_RISING)         ||                              \
    ((trigger) == EXINT_TRIGGER_FALLING)        ||                              \
    ((trigger) == EXINT_TRIGGER_BOTH))

/*  Parameter validity check for EXINT channel. */
#define IS_EXINT_CH(ch)     (((ch) & EXINT_CH_MASK) != (uint16_t)0x0000U)

/*  Parameter validity check for get EXINT channel. */
#define IS_GET_EXINT_CH(ch)                                                     \
(   ((ch) == EXINT_CH00)                        ||                              \
    ((ch) == EXINT_CH01)                        ||                              \
    ((ch) == EXINT_CH02)                        ||                              \
    ((ch) == EXINT_CH03)                        ||                              \
    ((ch) == EXINT_CH04)                        ||                              \
    ((ch) == EXINT_CH05)                        ||                              \
    ((ch) == EXINT_CH06)                        ||                              \
    ((ch) == EXINT_CH07))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
/**
 * @defgroup INTC_Local_Variable INTC Local Variable
 * @{
 */
static func_ptr_t pfnIrqHandler[IRQ_NUM_MAX] = {NULL};
static func_ptr_t pfnNmiCallback;
/**
 * @}
 */

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup INTC_Global_Functions INTC Global Functions
 * @{
 */
/**
 * @brief  IRQ sign in function
 * @param  [in] pstcIrqSignConfig: pointer of IRQ registration structure
 *   @arg  enIntSrc: can be any value @ref en_int_src_t
 *   @arg  enIRQn: can be any value from Int000~Int007 @ref IRQn_Type
 *   @arg  pfnCallback: Callback function
 * @retval Ok: IRQ register successfully
 *         ErrorInvalidParameter: ErrorInvalidParameter: IRQ No. is out of range;
 *                                NULL pointer.
 *         ErrorUninitialized: Specified IRQ entry was signed before.
 */
en_result_t INTC_IrqSignIn(const stc_irq_signin_config_t *pstcIrqSignConfig)
{
    __IO uint32_t *INTC_SELx;
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if ((NULL == pstcIrqSignConfig) || (pstcIrqSignConfig->enIRQn > Int007_IRQn))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        INTC_SELx = (uint32_t *)((uint32_t)(&M4_INTC->SEL0) + (4U * (pstcIrqSignConfig->enIRQn)));
        if ((0x1FFUL == ((*INTC_SELx) & 0x1FFUL)) || ((uint32_t)(pstcIrqSignConfig->enIRQn) == ((*INTC_SELx) & 0x1FFUL)))
        {
            WRITE_REG32(*INTC_SELx, pstcIrqSignConfig->enIntSrc);
            /* Callback function */
            pfnIrqHandler[pstcIrqSignConfig->enIRQn] = pstcIrqSignConfig->pfnCallback;
        }
        else
        {
            enRet = ErrorUninitialized;
        }

