levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_interrupts.c
    /* Check if pointer is NULL */
    if ((NULL == pstcNmiConfig) || (NULL == pstcNmiConfig->pfnNmiCallback))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Parameter validity checking */
        DDL_ASSERT(IS_NMI_FAE(pstcNmiConfig->u32NmiFAE));
        DDL_ASSERT(IS_NMI_FACLK(pstcNmiConfig->u32NmiFAClk));
        DDL_ASSERT(IS_NMI_FBE(pstcNmiConfig->u32NmiFBE));
        DDL_ASSERT(IS_NMI_EXINT_FBTIM(pstcNmiConfig->u32NmiFBTime));
        DDL_ASSERT(IS_NMI_TRIGGER(pstcNmiConfig->u32NmiTigger));
        DDL_ASSERT(IS_NMI_SRC(pstcNmiConfig->u32NmiSrc));

        /* NMI pin interrupt configure */
        WRITE_REG32(M4_INTC->NMICR,                                             \
                  (pstcNmiConfig->u32NmiFAE         |                           \
                   pstcNmiConfig->u32NmiFAClk       |                           \
                   pstcNmiConfig->u32NmiFBE         |                           \
                   pstcNmiConfig->u32NmiFBTime      |                           \
                   pstcNmiConfig->u32NmiTigger));

        /* Clear all NMI trigger source before set */
        WRITE_REG32(M4_INTC->NMICFR, INTC_NMICFR_MASK);

        /* NMI trigger source configure */
        WRITE_REG32(M4_INTC->NMIER, pstcNmiConfig->u32NmiSrc);

        /* NMI callback function configure */
        pfnNmiCallback = pstcNmiConfig->pfnNmiCallback;
    }
    return enRet;
}

/**
 * @brief  Get NMI trigger source
 * @param  [in] u32NmiSrc: NMI trigger source, @ref NMI_TriggerSrc_Sel for details
 *   @arg  NMI_SRC_NMI_PIN
 *   @arg  NMI_SRC_SWDT
 *   @arg  NMI_SRC_LVD1
 *   @arg  NMI_SRC_LVD2
 *   @arg  NMI_SRC_XTAL_STP
 *   @arg  NMI_SRC_RAMPE
 *   @arg  NMI_SRC_WDT
 * @retval Set: NMI is triggered by corresponding source
 *         Reset: NMI is not triggered by corresponding source
 */
en_flag_status_t NMI_GetNmiSrc(uint32_t u32NmiSrc)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_GET_NMI_SRC(u32NmiSrc));

    return ((READ_REG32(M4_INTC->NMIFR) & u32NmiSrc)) ? Set : Reset;
}

/**
 * @brief  Clear specified NMI trigger source
 * @param  [in] u32NmiSrc: NMI trigger source, @ref NMI_TriggerSrc_Sel for details
 *   @arg  NMI_SRC_NMI_PIN
 *   @arg  NMI_SRC_SWDT
 *   @arg  NMI_SRC_LVD1
 *   @arg  NMI_SRC_LVD2
 *   @arg  NMI_SRC_XTAL_STP
 *   @arg  NMI_SRC_RAMPE
 *   @arg  NMI_SRC_WDT
 * @retval None
 */
void NMI_ClrNmiSrc(uint32_t u32NmiSrc)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_NMI_SRC(u32NmiSrc));

    MODIFY_REG32(M4_INTC->NMICFR, INTC_NMICFR_MASK, u32NmiSrc);
}

/**
 * @brief  NMI IRQ handler
 * @param  None
 * @retval None
 */
void NMI_IrqHandler(void)
{
    if (NULL != pfnNmiCallback)
    {
        pfnNmiCallback();
    }
}

/**
 * @brief  Initialize External interrupt.
 * @param  [in] pstcExIntInit: Pointer to a pstcExIntInit structure that
 *                             contains configuration information.
 * @retval Ok:  EXINT initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t EXINT_Init(const stc_exint_config_t *pstcExIntInit)
{
    uint8_t u8ExIntPos = 0U;
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcExIntInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Parameter validity checking */
        DDL_ASSERT(IS_EXINT_FAE(pstcExIntInit->u32ExIntFAE));
        DDL_ASSERT(IS_EXINT_FBE(pstcExIntInit->u32ExIntFBE));
        DDL_ASSERT(IS_EXINT_FACLK(pstcExIntInit->u32ExIntFAClk));
        DDL_ASSERT(IS_NMI_EXINT_FBTIM(pstcExIntInit->u32ExIntFBTime));
        DDL_ASSERT(IS_EXINT_TRIGGER(pstcExIntInit->u32ExIntLvl));
        DDL_ASSERT(IS_EXINT_CH(pstcExIntInit->u32ExIntCh));

        for (u8ExIntPos = 0U; u8ExIntPos < 10U; u8ExIntPos++)
        {
            if (pstcExIntInit->u32ExIntCh & (1UL << u8ExIntPos))
            {
                WRITE_REG32(*(uint32_t *)((uint32_t)(&M4_INTC->EIRQCR0) + 4U*u8ExIntPos),   \
                          (pstcExIntInit->u32ExIntFAE           |                           \
                           pstcExIntInit->u32ExIntFAClk         |                           \
                           pstcExIntInit->u32ExIntFBE           |                           \
                           pstcExIntInit->u32ExIntFBTime        |                           \
                           pstcExIntInit->u32ExIntLvl));
            }
        }
    }
    return enRet;
}

/**
 * @brief  Initialize ExInt. Fill each pstcExIntInit with default value
 * @param  [in] pstcExIntInit: Pointer to a pstcExIntInit structure
 *                              that contains configuration information.
 * @retval Ok: EXINT structure initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t EXINT_StructInit(stc_exint_config_t *pstcExIntInit)
{
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcExIntInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcExIntInit->u32ExIntCh     = (uint16_t)0UL;
        pstcExIntInit->u32ExIntFAE    = EXINT_FILTER_A_OFF;
        pstcExIntInit->u32ExIntFAClk  = EXINT_FACLK_HCLK_DIV1;
        pstcExIntInit->u32ExIntFBE    = EXINT_FILTER_B_OFF;
        pstcExIntInit->u32ExIntFBTime = NMI_EXINT_FBTIM_500NS;
        pstcExIntInit->u32ExIntLvl    = EXINT_TRIGGER_FALLING;
    }
    return enRet;
}

/**
 * @brief  Clear specified External interrupt trigger source
 * @param  [in] u32ExIntCh: External interrupt channel, @ref EXINT_Channel_Sel for details
 *   @arg  EXINT_CH00
 *   @arg  EXINT_CH01
 *   @arg  EXINT_CH02
 *   @arg  EXINT_CH03
 *   @arg  EXINT_CH04
 *   @arg  EXINT_CH05
 *   @arg  EXINT_CH06
 *   @arg  EXINT_CH07
 * @retval None
 */
void EXINT_ClrExIntSrc(uint32_t u32ExIntCh)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_EXINT_CH(u32ExIntCh));

    SET_REG32_BIT(M4_INTC->EIRQCFR, u32ExIntCh);

}

/**
 * @brief  Get specified External interrupt trigger source
 * @param  [in] u32ExIntCh: External interrupt channel, @ref EXINT_Channel_Sel for details
 *   @arg  EXINT_CH00
 *   @arg  EXINT_CH01
 *   @arg  EXINT_CH02
 *   @arg  EXINT_CH03
 *   @arg  EXINT_CH04
 *   @arg  EXINT_CH05
 *   @arg  EXINT_CH06
 *   @arg  EXINT_CH07
 * @retval Set: Specified channel of external interrupt is triggered
 *         Reset: Specified channel of external interrupt is not triggered
 */
en_flag_status_t EXINT_GetExIntSrc(uint32_t u32ExIntCh)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_EXINT_CH(u32ExIntCh));

    return (READ_REG32(M4_INTC->EIRQFR) & u32ExIntCh) ? Set : Reset;
}

/**
 * @brief  NMI IRQ handler
 * @param  None
 * @retval None
 */
void NMI_Handler(void)
{
    NMI_IrqHandler();
}

/**
 * @brief  Hard Fault IRQ handler
 * @param  None
 * @retval None
 */
void HardFault_Handler(void)
{
    HardFault_IrqHandler();
}

/**
 * @brief  SVCall IRQ handler
 * @param  None
 * @retval None
 */
void SVC_Handler(void)
{
    SVC_IrqHandler();
}

/**
 * @brief  PendSV IRQ handler
 * @param  None
 * @retval None
 */
void PendSV_Handler(void)
{
    PendSV_IrqHandler();
}

/**
 * @brief  SysTick IRQ handler
 * @param  None
 * @retval None
 */
void SysTick_Handler(void)
{
    SysTick_IrqHandler();
}

/**
 * @brief  Interrupt No.000 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ000_Handler(void)
{
    pfnIrqHandler[Int000_IRQn]();
}

/**
 * @brief  Interrupt No.001 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ001_Handler(void)
{
    pfnIrqHandler[Int001_IRQn]();
}

/**
 * @brief  Interrupt No.002 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ002_Handler(void)
{
    pfnIrqHandler[Int002_IRQn]();
}

/**
 * @brief  Interrupt No.003 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ003_Handler(void)
{
    pfnIrqHandler[Int003_IRQn]();
}

/**
 * @brief  Interrupt No.004 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ004_Handler(void)
{
    pfnIrqHandler[Int004_IRQn]();
}

/**
 * @brief  Interrupt No.005 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ005_Handler(void)
{
    pfnIrqHandler[Int005_IRQn]();
}

/**
 * @brief  Interrupt No.006 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ006_Handler(void)
{
    pfnIrqHandler[Int006_IRQn]();
}

/**
 * @brief  Interrupt No.007 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ007_Handler(void)
{
    pfnIrqHandler[Int007_IRQn]();
}

/**
 * @brief  Interrupt No.008 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ008_Handler(void)
{
    EXINT00_SWINT08_IrqHandler();
}

/**
 * @brief  Interrupt No.009 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ009_Handler(void)
{
    EXINT01_SWINT09_IrqHandler();
}

/**
 * @brief  Interrupt No.010 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ010_Handler(void)
{
    EXINT02_SWINT10_IrqHandler();
}

/**
 * @brief  Interrupt No.011 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ011_Handler(void)
{
    EXINT03_SWINT11_IrqHandler();
}

/**
 * @brief  Interrupt No.012 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ012_Handler(void)
{
    EXINT04_SWINT12_IrqHandler();
}

/**
 * @brief  Interrupt No.013 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ013_Handler(void)
{
    EXINT05_SWINT13_IrqHandler();
}

/**
 * @brief  Interrupt No.014 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ014_Handler(void)
{
    EXINT06_SWINT14_IrqHandler();
}

/**
 * @brief  Interrupt No.015 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ015_Handler(void)
{
    EXINT07_SWINT15_IrqHandler();
}

/**
 * @brief  Interrupt No.016 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ016_Handler(void)
{
    DMA_Tc0_IrqHandler();
}

/**
 * @brief  Interrupt No.017 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ017_Handler(void)
{
    DMA_Tc1_IrqHandler();
}

/**
 * @brief  Interrupt No.018 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ018_Handler(void)
{
    DMA_Tc2_IrqHandler();
}

/**
 * @brief  Interrupt No.019 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ019_Handler(void)
{
    DMA_Tc3_IrqHandler();
}

/**
 * @brief  Interrupt No.020 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ020_Handler(void)
{
    DMA_Btc0_IrqHandler();
}

/**
 * @brief  Interrupt No.021 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ021_Handler(void)
{
    DMA_Btc1_IrqHandler();
}

/**
 * @brief  Interrupt No.022 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ022_Handler(void)
{
    DMA_Btc2_IrqHandler();
}

/**
 * @brief  Interrupt No.023 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ023_Handler(void)
{
    DMA_Btc3_IrqHandler();
}

/**
 * @brief  Interrupt No.024 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ024_Handler(void)
{
    DMA_Err_IrqHandler();
}

/**
 * @brief  Interrupt No.025 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ025_Handler(void)
{
    EFM_PgmEraseErr_IrqHandler();
}

/**
 * @brief  Interrupt No.026 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ026_Handler(void)
{
    EFM_ColErr_IrqHandler();
}

/**
 * @brief  Interrupt No.027 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ027_Handler(void)
{
    EFM_OpEnd_IrqHandler();
}

/**
 * @brief  Interrupt No.028 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ028_Handler(void)
{
    DCU_IrqHandler();
}

/**
 * @brief  Interrupt No.029 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ029_Handler(void)
{
    TMR0_1_CmpA_IrqHandler();
}

/**
 * @brief  Interrupt No.030 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ030_Handler(void)
{
    TMR0_1_CmpB_IrqHandler();
}

/**
 * @brief  Interrupt No.031 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ031_Handler(void)
{
    TMR0_2_CmpA_IrqHandler();
}

/**
 * @brief  Interrupt No.032 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ032_Handler(void)
{
    TMR0_2_CmpB_IrqHandler();
}

/**
 * @brief  Interrupt No.033 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ033_Handler(void)
{
    CLK_XtalStop_IrqHandler();
}

/**
 * @brief  Interrupt No.034 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ034_Handler(void)
{
    SWDT_IrqHandler();
}

/**
 * @brief  Interrupt No.035 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ035_Handler(void)
{
    TMRA_1_Ovf_IrqHandler();
}

/**
 * @brief  Interrupt No.036 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ036_Handler(void)
{
    TMRA_1_Udf_IrqHandler();
}

/**
 * @brief  Interrupt No.037 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ037_Handler(void)
{
    TMRA_1_Cmp_IrqHandler();
}

/**
 * @brief  Interrupt No.038 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ038_Handler(void)
{
    TMRA_2_Ovf_IrqHandler();
}

/**
 * @brief  Interrupt No.039 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ039_Handler(void)
{
    TMRA_2_Udf_IrqHandler();
}

/**
 * @brief  Interrupt No.040 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ040_Handler(void)
{
    TMRA_2_Cmp_IrqHandler();
}

/**
 * @brief  Interrupt No.041 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ041_Handler(void)
{
    TMRA_3_Ovf_IrqHandler();
}

/**
 * @brief  Interrupt No.042 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ042_Handler(void)
{
    TMRA_3_Udf_IrqHandler();
}

/**
 * @brief  Interrupt No.043 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ043_Handler(void)
{
    TMRA_3_Cmp_IrqHandler();
}

/**
 * @brief  Interrupt No.044 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ044_Handler(void)
{
    TMRA_4_Ovf_IrqHandler();
}

/**
 * @brief  Interrupt No.045 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ045_Handler(void)
{
    TMRA_4_Udf_IrqHandler();
}

/**
 * @brief  Interrupt No.046 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ046_Handler(void)
{
    TMRA_4_Cmp_IrqHandler();
}

/**
 * @brief  Interrupt No.047 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ047_Handler(void)
{
    TMRB_Ovf_IrqHandler();
}

/**
 * @brief  Interrupt No.048 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ048_Handler(void)
{
    TMRB_Udf_IrqHandler();
}

/**
 * @brief  Interrupt No.049 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ049_Handler(void)
{
    TMRB_Cmp_IrqHandler();
}

/**
 * @brief  Interrupt No.050 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ050_Handler(void)
{
    USART_1_RxErr_IrqHandler();
}

/**
 * @brief  Interrupt No.051 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ051_Handler(void)
{
    USART_1_RxEnd_IrqHandler();
}

/**
 * @brief  Interrupt No.052 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ052_Handler(void)
{
    USART_1_TxEmpty_IrqHandler();
}

/**
 * @brief  Interrupt No.053 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ053_Handler(void)
{
    USART_1_TxEnd_IrqHandler();
}

/**
 * @brief  Interrupt No.054 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ054_Handler(void)
{
    USART_2_RxErr_IrqHandler();
}

/**
 * @brief  Interrupt No.055 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ055_Handler(void)
{
    USART_2_RxEnd_IrqHandler();
}

/**
 * @brief  Interrupt No.056 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ056_Handler(void)
{
    USART_2_TxEmpty_IrqHandler();
}

/**
 * @brief  Interrupt No.057 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ057_Handler(void)
{
    USART_2_TxEnd_IrqHandler();
}

/**
 * @brief  Interrupt No.058 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ058_Handler(void)
{
    USART_3_RxErr_IrqHandler();
}

/**
 * @brief  Interrupt No.059 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ059_Handler(void)
{
    USART_3_RxEnd_IrqHandler();
}

/**
 * @brief  Interrupt No.060 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ060_Handler(void)
{
    USART_3_TxEmpty_IrqHandler();
}

/**
 * @brief  Interrupt No.061 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ061_Handler(void)
{
    USART_3_TxEnd_IrqHandler();
}

/**
 * @brief  Interrupt No.062 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ062_Handler(void)
{
    USART_4_RxErr_IrqHandler();
}

/**
 * @brief  Interrupt No.063 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ063_Handler(void)
{
    USART_4_RxEnd_IrqHandler();
}

/**
 * @brief  Interrupt No.064 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ064_Handler(void)
{
    USART_4_TxEmpty_IrqHandler();
}

/**
 * @brief  Interrupt No.065 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ065_Handler(void)
{
    USART_4_TxEnd_IrqHandler();
}

/**
 * @brief  Interrupt No.066 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ066_Handler(void)
{
    SPI_RxEnd_IrqHandler();
}

/**
 * @brief  Interrupt No.067 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ067_Handler(void)
{
    SPI_TxEmpty_IrqHandler();
}

/**
 * @brief  Interrupt No.068 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ068_Handler(void)
{
    SPI_Idle_IrqHandler();
}

/**
 * @brief  Interrupt No.069 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ069_Handler(void)
{
    SPI_Err_IrqHandler();
}

/**
 * @brief  Interrupt No.070 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ070_Handler(void)
{
    TMR4_GCmpUH_IrqHandler();
}

/**
 * @brief  Interrupt No.071 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ071_Handler(void)
{
    TMR4_GCmpUL_IrqHandler();
}

/**
 * @brief  Interrupt No.072 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ072_Handler(void)
{
    TMR4_GCmpVH_IrqHandler();
}

/**
 * @brief  Interrupt No.073 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ073_Handler(void)
{
    TMR4_GCmpVL_IrqHandler();
}

/**
 * @brief  Interrupt No.074 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ074_Handler(void)
{
    TMR4_GCmpWH_IrqHandler();
}

/**
 * @brief  Interrupt No.075 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ075_Handler(void)
{
    TMR4_GCmpWL_IrqHandler();
}

/**
 * @brief  Interrupt No.076 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ076_Handler(void)
{
    TMR4_Ovf_IrqHandler();
}

/**
 * @brief  Interrupt No.077 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ077_Handler(void)
{
    TMR4_Udf_IrqHandler();
}

/**
 * @brief  Interrupt No.078 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ078_Handler(void)
{
    TMR4_ReloadU_IrqHandler();
}

/**
 * @brief  Interrupt No.079 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ079_Handler(void)
{
    TMR4_ReloadV_IrqHandler();
}

/**
 * @brief  Interrupt No.080 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ080_Handler(void)
{
    TMR4_ReloadW_IrqHandler();
}

/**
 * @brief  Interrupt No.081 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ081_Handler(void)
{
    EMB_GR0_IrqHandler();
}

/**
 * @brief  Interrupt No.082 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ082_Handler(void)
{
    CMP_1_IrqHandler();
}

/**
 * @brief  Interrupt No.083 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ083_Handler(void)
{
    CMP_2_IrqHandler();
}

/**
 * @brief  Interrupt No.084 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ084_Handler(void)
{
    CMP_3_IrqHandler();
}

/**
 * @brief  Interrupt No.085 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ085_Handler(void)
{
    I2C_RxEnd_IrqHandler();
}

/**
 * @brief  Interrupt No.086 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ086_Handler(void)
{
    I2C_TxEnd_IrqHandler();
}

/**
 * @brief  Interrupt No.087 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ087_Handler(void)
{
    I2C_TxEmpty_IrqHandler();
}

/**
 * @brief  Interrupt No.088 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ088_Handler(void)
{
    I2C_Err_IrqHandler();
}

/**
 * @brief  Interrupt No.089 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ089_Handler(void)
{
    USART_1_WKUP_IrqHandler();
}

/**
 * @brief  Interrupt No.090 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ090_Handler(void)
{
    PWR_Lvd1_IrqHandler();
}

/**
 * @brief  Interrupt No.091 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ091_Handler(void)
{
    PWR_Lvd2_IrqHandler();
}

/**
 * @brief  Interrupt No.092 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ092_Handler(void)
{
    FCM_Err_IrqHandler();
}

/**
 * @brief  Interrupt No.093 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ093_Handler(void)
{
    FCM_End_IrqHandler();
}

/**
 * @brief  Interrupt No.094 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ094_Handler(void)
{
    FCM_Ovf_IrqHandler();
}

/**
 * @brief  Interrupt No.095 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ095_Handler(void)
{
    WDT_IrqHandler();
}

/**
 * @brief  Interrupt No.096 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ096_Handler(void)
{
    CTC_Err_IrqHandler();
}

/**
 * @brief  Interrupt No.097 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ097_Handler(void)
{
    ADC_SeqA_IrqHandler();
}

/**
 * @brief  Interrupt No.098 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ098_Handler(void)
{
    ADC_SeqB_IrqHandler();
}

/**
 * @brief  Interrupt No.099 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ099_Handler(void)
{
    ADC_ChCmp_IrqHandler();
}

/**
 * @brief  Interrupt No.100 IRQ handler
 * @param  None
 * @retval None
 */
void IRQ100_Handler(void)
{
    ADC_SeqCmp_IrqHandler();
}

/**
 * @}
 */

#endif /* DDL_INTERRUPTS_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
